Services/src/InformationRegisters/С_РегистрацияСервисов/С_РегистрацияСервисов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>С_РегистрацияСервисов</name>
  <resources>
    <name>Включен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаДействияС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаДействияПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>STATUS</name>
    <type>
      <types>EnumRef.СтатусыСервисовИТС</types>
    </type>
  </resources>
  <attributes>
    <name>IDCUSTOMER</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDREQUEST</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>NAMECUSTOMER</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Extra</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПользовательСервиса</name>
    <type>
      <types>CatalogRef.С_ПользователиСервисов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сервис</name>
    <type>
      <types>CatalogRef.С_Сервисы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.С_Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>IDDOCREQUEST</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>IDSERVICE</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>IDSERVICEVA</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Services/src/CommonModules/ПроверитьБесплатныеСервисы/Module.bsl
Процедура ПроверитьРегистрациюБесплатныхСервисов (Контрагент, Сервис) экспорт
	
	наборЗАписей = РегистрыСведений.С_РегистрацияСервисов.СоздатьНаборЗаписей();
	наборЗаписей.Отбор.ПользовательСервиса.Установить(Контрагент);
	наборЗаписей.Отбор.Сервис.Установить(Сервис);
	НаборЗАписей.Прочитать();
	
	Если наборЗАписей.Количество() = 0 Тогда
		Запись = НаборЗаписей.Добавить();
		Запись.ПользовательСервиса = Контрагент;
		Запись.Включен = Истина;
		Запись.Сервис = Сервис;
		
		Запись.ДатаДействияС = Дата('20170101');
		Запись.ДатаДействияпо = Дата('20190101');
		НаборЗАписей.Записать();
	КонецЕсли;
	
конецПроцедуры
